# Loading default datasets from libraries

In [3]:
import pandas as pd 
import numpy as np
import seaborn as sns
from pydataset import data
import warnings
warnings.filterwarnings("ignore")

### Loading the datasets from seaborn library

In [4]:
sns.get_dataset_names()

['anagrams',
 'anscombe',
 'attention',
 'brain_networks',
 'car_crashes',
 'diamonds',
 'dots',
 'dowjones',
 'exercise',
 'flights',
 'fmri',
 'geyser',
 'glue',
 'healthexp',
 'iris',
 'mpg',
 'penguins',
 'planets',
 'seaice',
 'taxis',
 'tips',
 'titanic']

In [5]:
df = sns.load_dataset('titanic')
df.head()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True

### Task : 
Load any 5 datasets and do EDA on it

### Loading the datasets from pydataset library

In [6]:
data()

        dataset_id                                             title
0    AirPassengers       Monthly Airline Passenger Numbers 1949-1960
1          BJsales                 Sales Data with Leading Indicator
2              BOD                         Biochemical Oxygen Demand
3     Formaldehyde                     Determination of Formaldehyde
4     HairEyeColor         Hair and Eye Color of Statistics Students
..             ...                                               ...
752        VerbAgg                  Verbal Aggression item responses
753           cake                 Breakage Angle of Chocolate Cakes
754           cbpp                 Contagious bovine pleuropneumonia
755    grouseticks  Data on red grouse ticks from Elston et al. 2001
756     sleepstudy       Reaction times in a sleep deprivation study

[757 rows x 2 columns]

#### We may access the specific number of index by iloc method or by slicing

In [7]:
data()[20:25]

,dataset_id,title
20,USJudgeRatings,Lawyers' Ratings of State Judges in the US Superior Court
21,USPersonalExpenditure,Personal Expenditure Data
22,VADeaths,Death Rates in Virginia (1940)
23,WWWusage,Internet Usage per Minute
24,WorldPhones,The World's Telephones

In [9]:
data().iloc[23]

dataset_id                     WWWusage
title         Internet Usage per Minute
Name: 23, dtype: object

#### getting the information about dataset

In [10]:
data('WWWusage', show_doc=True)

WWWusage

PyDataset Documentation (adopted from R Documentation. The displayed examples are in R)

## Internet Usage per Minute

### Description

A time series of the numbers of users connected to the Internet through a
server every minute.

### Usage

    WWWusage

### Format

A time series of length 100.

### Source

Durbin, J. and Koopman, S. J. (2001) _Time Series Analysis by State Space
Methods._ Oxford University Press. http://www.ssfpack.com/dkbook/

### References

Makridakis, S., Wheelwright, S. C. and Hyndman, R. J. (1998) _Forecasting:
Methods and Applications._ Wiley.

### Examples

    require(graphics)
    work <- diff(WWWusage)
    par(mfrow = c(2, 1)); plot(WWWusage); plot(work)
    ## Not run:
    require(stats)
    aics <- matrix(, 6, 6, dimnames = list(p = 0:5, q = 0:5))
    for(q in 1:5) aics[1, 1+q] <- arima(WWWusage, c(0, 1, q),
        optim.control = list(maxit = 500))$aic
    for(p in 1:5)
       for(q in 0:5) aics[1+p, 1+q] <- arima(WWWusage, c(p, 1, q),
           optim.control = list(maxit = 500))$aic
    round(aics - min(aics, na.rm = TRUE), 2)
    ## End(Not run)

In [11]:
df = data('WWWusage')
df.head()

   time  WWWusage
1     1        88
2     2        84
3     3        85
4     4        85
5     5        84

In [12]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 100 entries, 1 to 100
Data columns (total 2 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   time      100 non-null    int64
 1   WWWusage  100 non-null    int64
dtypes: int64(2)
memory usage: 2.3 KB